In [11]:
vals = [1,5,9,6]
data = {'name':['Hhd', 'sfs', 'asfsf'], 'age': [1,3,4]}
import pandas as pd

## Series

In [12]:
pd.Series(vals)

0    1
1    5
2    9
3    6
dtype: int64

In [16]:
pd.Series(vals, index=['a', 'b', 'c', 'd'], dtype='float')

a    1.0
b    5.0
c    9.0
d    6.0
dtype: float64

In [18]:
pd.Series(data)

name    [Hhd, sfs, asfsf]
age             [1, 3, 4]
dtype: object

## Dataframe

In [24]:
pd.DataFrame(vals)

   0
0  1
1  5
2  9
3  6

In [48]:
pd.DataFrame(data)

    name  age
0    Hhd    1
1    sfs    3
2  asfsf    4

## Show specific columns

In [37]:
pd.DataFrame(data, columns=['name'], index=['a', 'b', 'c'])

    name
a    Hhd
b    sfs
c  asfsf

In [30]:
import pandas as pd

# Existing DataFrame
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2'],
                    'C': ['C0', 'C1', 'C2'],
                    'D': ['D0', 'D1', 'D2']},
                   index=[0, 1, 2])

# New DataFrame with different columns
df2 = pd.DataFrame({'B': ['B3', 'B4', 'B5'],
                    'D': ['D3', 'D4', 'D5'],
                    'F': ['F3', 'F4', 'F5']},
                   index=[3, 4, 5])

print(df1)
print(df2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
    B   D   F
3  B3  D3  F3
4  B4  D4  F4
5  B5  D5  F5

In [50]:
result = pd.concat([df1, df2])
print(result)
result.to_excel('test.xlsx', index=False)
result.to_csv('test.csv', index=False)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3  NaN  B3  NaN  D3   F3
4  NaN  B4  NaN  D4   F4
5  NaN  B5  NaN  D5   F5

In [65]:
print(pd.read_csv('test.csv', index_col='B').fillna('hello'))
print(pd.read_excel('test.xlsx', index_col='A').fillna('hello'))

# Index Column with NaN will not be replaced

        A      C   D      F
B
B0     A0     C0  D0  hello
B1     A1     C1  D1  hello
B2     A2     C2  D2  hello
B3  hello  hello  D3     F3
B4  hello  hello  D4     F4
B5  hello  hello  D5     F5
      B      C   D      F
A
A0   B0     C0  D0  hello
A1   B1     C1  D1  hello
A2   B2     C2  D2  hello
NaN  B3  hello  D3     F3
NaN  B4  hello  D4     F4
NaN  B5  hello  D5     F5

In [86]:
result.dropna(axis=0, how='all', inplace=False)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3  NaN  B3  NaN  D3   F3
4  NaN  B4  NaN  D4   F4
5  NaN  B5  NaN  D5   F5